#!/usr/bin/env python
# coding: utf-8

# In[11]:


#จงเขียนโปรแกรมตรวจสอบคะแนนเด็กนักเรียน ถ้าเด็กได้คะแนนมากกว่า 80 เกรด A มากกว่า 70 เกรด B มากกว่า 60 เกรด C มากกว่า 50 เกรด D และต่ำกว่า 50 เกรด F
i = 75  #i=คะแนนสอบ
if (i > 80):
    print ("A")
elif(i >70 and i <= 80 ):
    print ("B")
elif(i >60 and i <= 70 ):
    print ("C")
elif(i >50 and i <= 60 ):
    print ("D")
elif (i<50): 
    print ("F")
else: #ถ้าได้คะแนน 50 คะแนน จะไม่มีเกรด เพราะโจทย์บอกว่า คะแนน > 50 ได้ D, คะแนน < 50 ได้ F
    print("error")


# In[ ]:




